package com.caizhidao.enums;

/**
 * 开户状态返回状态枚举
 * @author Jail Hu
 *  
 */
public enum ResultCodeEnum {
	开户操作成功(1),操作失败(-1),
	会员开户接口异常(-2),
	会员编号不合法(-100),
	证件号不合法(-101),
	省市县或区应为中文(-102),
	交易密码或电话密码不合法(-103),
	交易账号已存在(-104),
	会员不存在(-105),
	交易账号不合法(-106),
	邮箱不合法(-107),
	传真或电话不合法(-108),
	邮政编码不合法(-109),
	客户名称不合法(-110),
	证件类型不合法(-111),
	证件号码和证件类型在此会员下已存在(-112),
	交易核心未找到会员(-113),
	当前市场状态不允许操作(-114),
	会员状态不正确(-115),
	通讯地址不正确(-116),
	机构代码不合法(-117),
	机构不存在或者不属于该会员(-118),
	居间代码不合法(-119),
	居间不存在或不属于改机构或不属于该会员(-120),
	开户信息不完整或格式错误(-201301),
	通讯标识不存在或未开通不允许开户(-201302),
	会员单位不存在(-201303),
	用户保存或更新错误请联系管理员(-201305),
	只能支持证件类型为2的身份证(-201305),
	实盘账户已存在(-201306),
	实盘账户保存出错请联系管理员(-201307),
	实盘账号已使用(-201308),
	用户账户已锁定请联系管理员(-201309),
	会员账号格式错误必须为数字(-201501),
	会员账号和会员单位不相符(-201502),
	今天是非业务办理日网上开户平台不支持开户业务的办理与查询请在业务办理日进行操作(-201503),
	开户token和会员实盘编号不一致(-201504),
	开户信息提交成功我们将在审核后正式提交交易所(-999999);
	private int index;

	private ResultCodeEnum(int index) {
		this.setIndex(index);
	}

	/**
	 * 根据编码获得中文
	 * 
	 * @param index
	 * @return
	 */
	public static String getName(int index) {
		for (ResultCodeEnum c : ResultCodeEnum.values()) {
			if (c.getIndex() == index) {
				return c.name();
			}
		}
		return null;
	}

	public int getIndex() {
		return index;
	}

	public void setIndex(int index) {
		this.index = index;
	}
}
