package com.caizhidao.enums;

/**
 * 开户银行返回状态枚举
 * @author Jail Hu
 *  
 */
public enum ResultBankCodeEnum {
	银行卡校验成功(1),操作失败(-1),
	通讯异常(0),
	银行卡校验超过限制次数3次及以上(-201401),
	会员单位未开通此银行的验证功能请联系管理员(-201402),
	实盘开户错误请联系管理员(-201403),
	银行卡校验错误请联系管理员(-201404),
	已校验过银行卡(-201405),
	银行卡验证信息不完整(-300),
	查询过于频繁请稍后重试(-301),
	未查询到资金帐号信息(-302),
	银行处理失败(-100),
	交易账号不合法(-303),
	币种代码不合法(-304),
	账号类别不合法(-305),
	证件类别不合法(-306),
	证件号码不合法(-307),
	客户名称不合法(-308),
	国别代码不合法(-309),
	客户性别不合法(-310),
	推荐人编号不合法(-311),
	银行分行号不合法(-312),
	银行代码字段不合法(-313),
	合作方机构号不合法(-314),
	环境为模拟盘只在实盘下可用(-315),
	交易账号不存在(-316),
	银行账号不合法(-317),
	未找到与银行代码匹配的银行(-318),
	银行账号注册信息不完整(-40001),
	银行账号注册交易账号不存在(-40002),
	银行账号注册银行不存在(-40003),
	银行账号注册账号已注册(-40004),
	银行账号注册银行签约失败(-40005),
	银行账号注册数据库操作失败(-40006),
	银行账号注册系统异常(-40007),
	交易账号密码错误(-40008),
	客户已终止(-40009),
	预签约失败(-40035),
	未预签约(-40036),
	客户状态不正确(-40019),
	不存在的客户(-40026),
	不在转账时间内(-50004),
	系统异常1(-20029),
	数据库异常1(-20028),
	交易账号和账号对应关系错误(-20027),
	交易账号被禁用(-20026),
	非法交易账号(-20025),
	非法银行账号(-20024),
	交易账号未签约(-20023),
	银行返回客户证件与开户时不符(-20020),
	参数错误(-20021),
	非法交易账号代码(-20032),
	数据库异常2(-20033),
	银行返回客户银行账号异常(-30007),
	连接服务器超时(-50005),
	银行返回数据包为空(-50010),
	发送数据IO异常(-50011),
	同步交易账号数据库异常请检查(-500014),
	银行返回其他错误(-920001),
	本笔交易已经受理(-930000),
	当前不是交易日期(-920003),
	未到交易时间(-920004),
	交易时间已过(-920005),
	系统出现异常情况交易被禁止(-920006),
	流水号冲突(-920008),
	流水已经有人处理(-920009),
	银行账号异常(920012),
	银行账号被锁定(-710001),
	密码错误(-910002),
	处理器获取适配器失败(-920000),
	交易账号异常(-920010),
	银行编号异常(-920011),
	未查询到交易账号信息(-920013),
	查询到交易账号信息重复(-920014),
	数据库异常3(-920015),
	系统异常3(-920016),
	银行被禁用(-920017),
	账户验证未通过(-9999);
	private int index;

	private ResultBankCodeEnum(int index) {
		this.setIndex(index);
	}

	/**
	 * 根据编码获得中文
	 * 
	 * @param index
	 * @return
	 */
	public static String getName(int index) {
		for (ResultBankCodeEnum c : ResultBankCodeEnum.values()) {
			if (c.getIndex() == index) {
				return c.name();
			}
		}
		return null;
	}

	public int getIndex() {
		return index;
	}

	public void setIndex(int index) {
		this.index = index;
	}
}
